Практос_2/src/Documents/РезультатИнтервью/РезультатИнтервью.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатИнтервью</name>
  <basedOn>Document.НазначениеИнтервью</basedOn>
  <registerRecords>InformationRegister.ИсторияКандидатов</registerRecords>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекрутер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПодбора</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Практос_2/src/InformationRegisters/ИсторияКандидатов/ИсторияКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияКандидатов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЭтапПодбора</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Практос_2/src/Documents/РезультатИнтервью/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИсторияКандидатов
	Движения.ИсторияКандидатов.Записывать = Истина;
	Движение = Движения.ИсторияКандидатов.Добавить();
	Движение.Период = Дата;
	Движение.Кандидат = Кандидат;
	Движение.Вакансия = Вакансия;
	Движение.ЭтапПодбора = ЭтапПодбора;
	Движение.Ответственный = Вакансия;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НазначениеИнтервью") Тогда
		// Заполнение шапки
		Вакансия = ДанныеЗаполнения.Вакансия;
		Кандидат = ДанныеЗаполнения.Кандидат;
		Рекрутер = ДанныеЗаполнения.Рекрутер;
		ЭтапПодбора = ДанныеЗаполнения.ЭтапПодбора;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
